Documents/ПеремещениеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПеремещениеМатериалов</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеМатериаловУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПеремещениеМатериалов/Ext/ManagerModule.bsl
Процедура ПечатьПеремещениеМатериалов(ТабДок, Ссылка) Экспорт

	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0";
	
	Макет = Документы.ПеремещениеМатериалов.ПолучитьМакет("ПечатьПеремещениеМатериалов");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеМатериалов.Ссылка,
	|	ПеремещениеМатериалов.Автор,
	|	ПеремещениеМатериалов.Дата,
	|	ПеремещениеМатериалов.Номер,
	|	ПеремещениеМатериалов.Подразделение,
	|	ПеремещениеМатериалов.ПодразделениеПолучатель,
	|	ПеремещениеМатериалов.Склад,
	|	ПеремещениеМатериалов.СкладПолучатель,
	|	ПеремещениеМатериалов.СуммаДокумента,
	|	ПеремещениеМатериалов.МатериалыОтгружено.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		ЕдиницаХранения,
	|		Коэффициент,
	|		Цена,
	|		Сумма
	|	),
	|	ПеремещениеМатериалов.Склад.МОЛ,
	|	ПеремещениеМатериалов.СкладПолучатель.МОЛ,
	|	ВЫБОР
	|		КОГДА ПеремещениеМатериалов.Подразделение = ПеремещениеМатериалов.ПодразделениеПолучатель
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РазныеПодразделения
	|ИЗ
	|	Документ.ПеремещениеМатериалов КАК ПеремещениеМатериалов
	|ГДЕ
	|	ПеремещениеМатериалов.Проведен
	|	И ПеремещениеМатериалов.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьМатериалыОтгруженоШапка = Макет.ПолучитьОбласть("МатериалыОтгруженоШапка");
	ОбластьМатериалыОтгружено = Макет.ПолучитьОбласть("МатериалыОтгружено");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		СуммаМатериалов = 0;
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьМатериалыОтгруженоШапка);
		
		Если Выборка.РазныеПодразделения Тогда
			ВыборкаМатериалыОтгружено = Выборка.МатериалыОтгружено.Выбрать();
			Пока ВыборкаМатериалыОтгружено.Следующий() Цикл
				ОбластьМатериалыОтгружено.Параметры.Заполнить(ВыборкаМатериалыОтгружено);
				ОбластьМатериалыОтгружено.Параметры.Сумма = ВыборкаМатериалыОтгружено.Сумма;
				ТабДок.Вывести(ОбластьМатериалыОтгружено, ВыборкаМатериалыОтгружено.Уровень());
				СуммаМатериалов = ВыборкаМатериалыОтгружено.Сумма + СуммаМатериалов;
			КонецЦикла;
		Иначе 
			ТаблицаМатериалов = СформироватьТаблицуМатерилов(Выборка.Ссылка);
			Для каждого Стр Из ТаблицаМатериалов Цикл
				ОбластьМатериалыОтгружено.Параметры.Заполнить(Стр);
				ТабДок.Вывести(ОбластьМатериалыОтгружено);
			КонецЦикла;
			СуммаМатериалов = ТаблицаМатериалов.Итог("Сумма");
		КонецЕсли;
		
		Подвал.Параметры.СуммаМатериалов = СуммаМатериалов;
		Подвал.Параметры.СуммаМатериаловПрописью = ЧислоПрописью(СуммаМатериалов, ФормСтрока, ПарПредмета);
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьТаблицуМатерилов(ДокСсылка)

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Цена");

	ТЧДокумент = ДокСсылка.МатериалыОтгружено.Выгрузить();

	Проводки = РегистрыНакопления.МатериалыНаСкладах.ВыбратьПоРегистратору(ДокСсылка);
	Пока Проводки.Следующий() Цикл
		Если Проводки.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
			НоваяСтрока = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Проводки);
			НоваяСтрока.Цена = Проводки.Стоимость / (Проводки.Количество * Проводки.ЕдиницаХранения.Коэффициент);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ТЧСтрока Из ТЧДокумент Цикл
		ЦенаСписания = ТЗ.Найти(ТЧСтрока.Номенклатура).Цена;
		ТЧСтрока.Цена = ЦенаСписания;
		ТЧСтрока.Сумма = ЦенаСписания * ТЧСтрока.Количество * ТЧСтрока.Коэффициент;
	КонецЦикла;
	
	Возврат ТЧДокумент;

КонецФункции // СформироватьТаблицуМатерилов()
